MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAA169/mcu.h
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNNEDCLR         /* 0xBF8603A4 */
  .extern CNNEDSET         /* 0xBF8603A8 */
  .extern CNNEDINV         /* 0xBF8603AC */
  .extern CNFD             /* 0xBF8603B0 */
  .extern CNFDCLR          /* 0xBF8603B4 */
  .extern CNFDSET          /* 0xBF8603B8 */
  .extern CNFDINV          /* 0xBF8603BC */
  .extern SRCON0D          /* 0xBF8603C0 */
  .extern SRCON0DCLR       /* 0xBF8603C4 */
  .extern SRCON0DSET       /* 0xBF8603C8 */
  .extern SRCON0DINV       /* 0xBF8603CC */
  .extern SRCON1D          /* 0xBF8603D0 */
  .extern SRCON1DCLR       /* 0xBF8603D4 */
  .extern SRCON1DSET       /* 0xBF8603D8 */
  .extern SRCON1DINV       /* 0xBF8603DC */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
  .extern CNCONESET        /* 0xBF860478 */
  .extern CNCONEINV        /* 0xBF86047C */
  .extern CNENE            /* 0xBF860480 */
  .extern CNENECLR         /* 0xBF860484 */
  .extern CNENESET         /* 0xBF860488 */
  .extern CNENEINV         /* 0xBF86048C */
  .extern CNSTATE          /* 0xBF860490 */
  .extern CNSTATECLR       /* 0xBF860494 */
  .extern CNSTATESET       /* 0xBF860498 */
  .extern CNSTATEINV       /* 0xBF86049C */
  .extern CNNEE            /* 0xBF8604A0 */
  .extern CNNEECLR         /* 0xBF8604A4 */
  .extern CNNEESET         /* 0xBF8604A8 */
  .extern CNNEEINV         /* 0xBF8604AC */
  .extern CNFE             /* 0xBF8604B0 */
  .extern CNFECLR          /* 0xBF8604B4 */
  .extern CNFESET          /* 0xBF8604B8 */
  .extern CNFEINV          /* 0xBF8604BC */
  .extern SRCON0E          /* 0xBF8604C0 */
  .extern SRCON0ECLR       /* 0xBF8604C4 */
  .extern SRCON0ESET       /* 0xBF8604C8 */
  .extern SRCON0EINV       /* 0xBF8604CC */
  .extern SRCON1E          /* 0xBF8604D0 */
  .extern SRCON1ECLR       /* 0xBF8604D4 */
  .extern SRCON1ESET       /* 0xBF8604D8 */
  .extern SRCON1EINV       /* 0xBF8604DC */
  .extern ANSELF           /* 0xBF860500 */
  .extern ANSELFCLR        /* 0xBF860504 */
  .extern ANSELFSET        /* 0xBF860508 */
  .extern ANSELFINV        /* 0xBF86050C */
  .extern TRISF            /* 0xBF860510 */
  .extern TRISFCLR         /* 0xBF860514 */
  .extern TRISFSET         /* 0xBF860518 */
  .extern TRISFINV         /* 0xBF86051C */
  .extern PORTF            /* 0xBF860520 */
  .extern PORTFCLR         /* 0xBF860524 */
  .extern PORTFSET         /* 0xBF860528 */
  .extern PORTFINV         /* 0xBF86052C */
  .extern LATF             /* 0xBF860530 */
  .extern LATFCLR          /* 0xBF860534 */
  .extern LATFSET          /* 0xBF860538 */
  .extern LATFINV          /* 0xBF86053C */
  .extern ODCF             /* 0xBF860540 */
  .extern ODCFCLR          /* 0xBF860544 */
  .extern ODCFSET          /* 0xBF860548 */
  .extern ODCFINV          /* 0xBF86054C */
  .extern CNPUF            /* 0xBF860550 */
  .extern CNPUFCLR         /* 0xBF860554 */
  .extern CNPUFSET         /* 0xBF860558 */
  .extern CNPUFINV         /* 0xBF86055C */
  .extern CNPDF            /* 0xBF860560 */
  .extern CNPDFCLR         /* 0xBF860564 */
  .extern CNPDFSET         /* 0xBF860568 */
  .extern CNPDFINV         /* 0xBF86056C */
  .extern CNCONF           /* 0xBF860570 */
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern CNNEF            /* 0xBF8605A0 */
  .extern CNNEFCLR         /* 0xBF8605A4 */
  .extern CNNEFSET         /* 0xBF8605A8 */
  .extern CNNEFINV         /* 0xBF8605AC */
  .extern CNFF             /* 0xBF8605B0 */
  .extern CNFFCLR          /* 0xBF8605B4 */
  .extern CNFFSET          /* 0xBF8605B8 */
  .extern CNFFINV          /* 0xBF8605BC */
  .extern SRCON0F          /* 0xBF8605C0 */
  .extern SRCON0FCLR       /* 0xBF8605C4 */
  .extern SRCON0FSET       /* 0xBF8605C8 */
  .extern SRCON0FINV       /* 0xBF8605CC */
  .extern SRCON1F          /* 0xBF8605D0 */
  .extern SRCON1FCLR       /* 0xBF8605D4 */
  .extern SRCON1FSET       /* 0xBF8605D8 */
  .extern SRCON1FINV       /* 0xBF8605DC */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern CNNEG            /* 0xBF8606A0 */
  .extern CNNEGCLR         /* 0xBF8606A4 */
  .extern CNNEGSET         /* 0xBF8606A8 */
  .extern CNNEGINV         /* 0xBF8606AC */
  .extern CNFG             /* 0xBF8606B0 */
  .extern CNFGCLR          /* 0xBF8606B4 */
  .extern CNFGSET          /* 0xBF8606B8 */
  .extern CNFGINV          /* 0xBF8606BC */
  .extern SRCON0G          /* 0xBF8606C0 */
  .extern SRCON0GCLR       /* 0xBF8606C4 */
  .extern SRCON0GSET       /* 0xBF8606C8 */
  .extern SRCON0GINV       /* 0xBF8606CC */
  .extern SRCON1G          /* 0xBF8606D0 */
  .extern SRCON1GCLR       /* 0xBF8606D4 */
  .extern SRCON1GSET       /* 0xBF8606D8 */
  .extern SRCON1GINV       /* 0xBF8606DC */
  .extern ANSELH           /* 0xBF860700 */
  .extern ANSELHCLR        /* 0xBF860704 */
  .extern ANSELHSET        /* 0xBF860708 */
  .extern ANSELHINV        /* 0xBF86070C */
  .extern TRISH            /* 0xBF860710 */
  .extern TRISHCLR         /* 0xBF860714 */
  .extern TRISHSET         /* 0xBF860718 */
  .extern TRISHINV         /* 0xBF86071C */
  .extern PORTH            /* 0xBF860720 */
  .extern PORTHCLR         /* 0xBF860724 */
  .extern PORTHSET         /* 0xBF860728 */
  .extern PORTHINV         /* 0xBF86072C */
  .extern LATH             /* 0xBF860730 */
  .extern LATHCLR          /* 0xBF860734 */
  .extern LATHSET          /* 0xBF860738 */
  .extern LATHINV          /* 0xBF86073C */
  .extern ODCH             /* 0xBF860740 */
  .extern ODCHCLR          /* 0xBF860744 */
  .extern ODCHSET          /* 0xBF860748 */
  .extern ODCHINV          /* 0xBF86074C */
  .extern CNPUH            /* 0xBF860750 */
  .extern CNPUHCLR         /* 0xBF860754 */
  .extern CNPUHSET         /* 0xBF860758 */
  .extern CNPUHINV         /* 0xBF86075C */
  .extern CNPDH            /* 0xBF860760 */
  .extern CNPDHCLR         /* 0xBF860764 */
  .extern CNPDHSET         /* 0xBF860768 */
  .extern CNPDHINV         /* 0xBF86076C */
  .extern CNCONH           /* 0xBF860770 */
  .extern CNCONHCLR        /* 0xBF860774 */
  .extern CNCONHSET        /* 0xBF860778 */
  .extern CNCONHINV        /* 0xBF86077C */
  .extern CNENH            /* 0xBF860780 */
  .extern CNENHCLR         /* 0xBF860784 */
  .extern CNENHSET         /* 0xBF860788 */
  .extern CNENHINV         /* 0xBF86078C */
  .extern CNSTATH          /* 0xBF860790 */
  .extern CNSTATHCLR       /* 0xBF860794 */
  .extern CNSTATHSET       /* 0xBF860798 */
  .extern CNSTATHINV       /* 0xBF86079C */
  .extern CNNEH            /* 0xBF8607A0 */
  .extern CNNEHCLR         /* 0xBF8607A4 */
  .extern CNNEHSET         /* 0xBF8607A8 */
  .extern CNNEHINV         /* 0xBF8607AC */
  .extern CNFH             /* 0xBF8607B0 */
  .extern CNFHCLR          /* 0xBF8607B4 */
  .extern CNFHSET          /* 0xBF8607B8 */
  .extern CNFHINV          /* 0xBF8607BC */
  .extern SRCON0H          /* 0xBF8607C0 */
  .extern SRCON0HCLR       /* 0xBF8607C4 */
  .extern SRCON0HSET       /* 0xBF8607C8 */
  .extern SRCON0HINV       /* 0xBF8607CC */
  .extern SRCON1H          /* 0xBF8607D0 */
  .extern SRCON1HCLR       /* 0xBF8607D4 */
  .extern SRCON1HSET       /* 0xBF8607D8 */
  .extern SRCON1HINV       /* 0xBF8607DC */
  .extern ANSELJ           /* 0xBF860800 */
  .extern ANSELJCLR        /* 0xBF860804 */
  .extern ANSELJSET        /* 0xBF860808 */
  .extern ANSELJINV        /* 0xBF86080C */
  .extern TRISJ            /* 0xBF860810 */
  .extern TRISJCLR         /* 0xBF860814 */
  .extern TRISJSET         /* 0xBF860818 */
  .extern TRISJINV         /* 0xBF86081C */
  .extern PORTJ            /* 0xBF860820 */
  .extern PORTJCLR         /* 0xBF860824 */
  .extern PORTJSET         /* 0xBF860828 */
  .extern PORTJINV         /* 0xBF86082C */
  .extern LATJ             /* 0xBF860830 */
  .extern LATJCLR          /* 0xBF860834 */
  .extern LATJSET          /* 0xBF860838 */
  .extern LATJINV          /* 0xBF86083C */
  .extern ODCJ             /* 0xBF860840 */
  .extern ODCJCLR          /* 0xBF860844 */
  .extern ODCJSET          /* 0xBF860848 */
  .extern ODCJINV          /* 0xBF86084C */
  .extern CNPUJ            /* 0xBF860850 */
  .extern CNPUJCLR         /* 0xBF860854 */
  .extern CNPUJSET         /* 0xBF860858 */
  .extern CNPUJINV         /* 0xBF86085C */
  .extern CNPDJ            /* 0xBF860860 */
  .extern CNPDJCLR         /* 0xBF860864 */
  .extern CNPDJSET         /* 0xBF860868 */
  .extern CNPDJINV         /* 0xBF86086C */
  .extern CNCONJ           /* 0xBF860870 */
  .extern CNCONJCLR        /* 0xBF860874 */
  .extern CNCONJSET        /* 0xBF860878 */
  .extern CNCONJINV        /* 0xBF86087C */
  .extern CNENJ            /* 0xBF860880 */
  .extern CNENJCLR         /* 0xBF860884 */
  .extern CNENJSET         /* 0xBF860888 */
  .extern CNENJINV         /* 0xBF86088C */
  .extern CNSTATJ          /* 0xBF860890 */
  .extern CNSTATJCLR       /* 0xBF860894 */
  .extern CNSTATJSET       /* 0xBF860898 */
  .extern CNSTATJINV       /* 0xBF86089C */
  .extern CNNEJ            /* 0xBF8608A0 */
  .extern CNNEJCLR         /* 0xBF8608A4 */
  .extern CNNEJSET         /* 0xBF8608A8 */
  .extern CNNEJINV         /* 0xBF8608AC */
  .extern CNFJ             /* 0xBF8608B0 */
  .extern CNFJCLR          /* 0xBF8608B4 */
  .extern CNFJSET          /* 0xBF8608B8 */
  .extern CNFJINV          /* 0xBF8608BC */
  .extern SRCON0J          /* 0xBF8608C0 */
  .extern SRCON0JCLR       /* 0xBF8608C4 */
  .extern SRCON0JSET       /* 0xBF8608C8 */
  .extern SRCON0JINV       /* 0xBF8608CC */
  .extern SRCON1J          /* 0xBF8608D0 */
  .extern SRCON1JCLR       /* 0xBF8608D4 */
  .extern SRCON1JSET       /* 0xBF8608D8 */
  .extern SRCON1JINV       /* 0xBF8608DC */
  .extern ANSELK           /* 0xBF860900 */
  .extern ANSELKCLR        /* 0xBF860904 */
  .extern ANSELKSET        /* 0xBF860908 */
  .extern ANSELKINV        /* 0xBF86090C */
  .extern TRISK            /* 0xBF860910 */
  .extern TRISKCLR         /* 0xBF860914 */
  .extern TRISKSET         /* 0xBF860918 */
  .extern TRISKINV         /* 0xBF86091C */
  .extern PORTK            /* 0xBF860920 */
  .extern PORTKCLR         /* 0xBF860924 */
  .extern PORTKSET         /* 0xBF860928 */
  .extern PORTKINV         /* 0xBF86092C */
  .extern LATK             /* 0xBF860930 */
  .extern LATKCLR          /* 0xBF860934 */
  .extern LATKSET          /* 0xBF860938 */
  .extern LATKINV          /* 0xBF86093C */
  .extern ODCK             /* 0xBF860940 */
  .extern ODCKCLR          /* 0xBF860944 */
  .extern ODCKSET          /* 0xBF860948 */
  .extern ODCKINV          /* 0xBF86094C */
  .extern CNPUK            /* 0xBF860950 */
  .extern CNPUKCLR         /* 0xBF860954 */
  .extern CNPUKSET         /* 0xBF860958 */
  .extern CNPUKINV         /* 0xBF86095C */
  .extern CNPDK            /* 0xBF860960 */
  .extern CNPDKCLR         /* 0xBF860964 */
  .extern CNPDKSET         /* 0xBF860968 */
  .extern CNPDKINV         /* 0xBF86096C */
  .extern CNCONK           /* 0xBF860970 */
  .extern CNCONKCLR        /* 0xBF860974 */
  .extern CNCONKSET        /* 0xBF860978 */
  .extern CNCONKINV        /* 0xBF86097C */
  .extern CNENK            /* 0xBF860980 */
  .extern CNENKCLR         /* 0xBF860984 */
  .extern CNENKSET         /* 0xBF860988 */
  .extern CNENKINV         /* 0xBF86098C */
  .extern CNSTATK          /* 0xBF860990 */
  .extern CNSTATKCLR       /* 0xBF860994 */
  .extern CNSTATKSET       /* 0xBF860998 */
  .extern CNSTATKINV       /* 0xBF86099C */
  .extern CNNEK            /* 0xBF8609A0 */
  .extern CNNEKCLR         /* 0xBF8609A4 */
  .extern CNNEKSET         /* 0xBF8609A8 */
  .extern CNNEKINV         /* 0xBF8609AC */
  .extern CNFK             /* 0xBF8609B0 */
  .extern CNFKCLR          /* 0xBF8609B4 */
  .extern CNFKSET          /* 0xBF8609B8 */
  .extern CNFKINV          /* 0xBF8609BC */
  .extern SRCON0K          /* 0xBF8609C0 */
  .extern SRCON0KCLR       /* 0xBF8609C4 */
  .extern SRCON0KSET       /* 0xBF8609C8 */
  .extern SRCON0KINV       /* 0xBF8609CC */
  .extern SRCON1K          /* 0xBF8609D0 */
  .extern SRCON1KCLR       /* 0xBF8609D4 */
  .extern SRCON1KSET       /* 0xBF8609D8 */
  .extern SRCON1KINV       /* 0xBF8609DC */
  .extern C1CON            /* 0xBF880000 */
  .extern C1CONCLR         /* 0xBF880004 */
  .extern C1CONSET         /* 0xBF880008 */
  .extern C1CONINV         /* 0xBF88000C */
  .extern C1CFG            /* 0xBF880010 */
  .extern C1CFGCLR         /* 0xBF880014 */
  .extern C1CFGSET         /* 0xBF880018 */
  .extern C1CFGINV         /* 0xBF88001C */
  .extern C1INT            /* 0xBF880020 */
  .extern C1INTCLR         /* 0xBF880024 */
  .extern C1INTSET         /* 0xBF880028 */
  .extern C1INTINV         /* 0xBF88002C */
  .extern C1VEC            /* 0xBF880030 */
  .extern C1VECCLR         /* 0xBF880034 */
  .extern C1VECSET         /* 0xBF880038 */
  .extern C1VECINV         /* 0xBF88003C */
  .extern C1TREC           /* 0xBF880040 */
  .extern C1TRECCLR        /* 0xBF880044 */
  .extern C1TRECSET        /* 0xBF880048 */
  .extern C1TRECINV        /* 0xBF88004C */
  .extern C1FSTAT          /* 0xBF880050 */
  .extern C1FSTATCLR       /* 0xBF880054 */
  .extern C1FSTATSET       /* 0xBF880058 */
  .extern C1FSTATINV       /* 0xBF88005C */
  .extern C1RXOVF          /* 0xBF880060 */
  .extern C1RXOVFCLR       /* 0xBF880064 */
  .extern C1RXOVFSET       /* 0xBF880068 */
  .extern C1RXOVFINV       /* 0xBF88006C */
  .extern C1TMR            /* 0xBF880070 */
  .extern C1TMRCLR         /* 0xBF880074 */
  .extern C1TMRSET         /* 0xBF880078 */
  .extern C1TMRINV         /* 0xBF88007C */
  .extern C1RXM0           /* 0xBF880080 */
  .extern C1RXM0CLR        /* 0xBF880084 */
  .extern C1RXM0SET        /* 0xBF880088 */
  .extern C1RXM0INV        /* 0xBF88008C */
  .extern C1RXM1           /* 0xBF880090 */
  .extern C1RXM1CLR        /* 0xBF880094 */
  .extern C1RXM1SET        /* 0xBF880098 */
  .extern C1RXM1INV        /* 0xBF88009C */
  .extern C1RXM2           /* 0xBF8800A0 */
  .extern C1RXM2CLR        /* 0xBF8800A4 */
  .extern C1RXM2SET        /* 0xBF8800A8 */
  .extern C1RXM2INV        /* 0xBF8800AC */
  .extern C1RXM3           /* 0xBF8800B0 */
  .extern C1RXM3CLR        /* 0xBF8800B4 */
  .extern C1RXM3SET        /* 0xBF8800B8 */
  .extern C1RXM3INV        /* 0xBF8800BC */
  .extern C1FLTCON0        /* 0xBF8800C0 */
  .extern C1FLTCON0CLR     /* 0xBF8800C4 */
  .extern C1FLTCON0SET     /* 0xBF8800C8 */
  .extern C1FLTCON0INV     /* 0xBF8800CC */
  .extern C1FLTCON1        /* 0xBF8800D0 */
  .extern C1FLTCON1CLR     /* 0xBF8800D4 */
  .extern C1FLTCON1SET     /* 0xBF8800D8 */
  .extern C1FLTCON1INV     /* 0xBF8800DC */
  .extern C1FLTCON2        /* 0xBF8800E0 */
  .extern C1FLTCON2CLR     /* 0xBF8800E4 */
  .extern C1FLTCON2SET     /* 0xBF8800E8 */
  .extern C1FLTCON2INV     /* 0xBF8800EC */
  .extern C1FLTCON3        /* 0xBF8800F0 */
  .extern C1FLTCON3CLR     /* 0xBF8800F4 */
  .extern C1FLTCON3SET     /* 0xBF8800F8 */
  .extern C1FLTCON3INV     /* 0xBF8800FC */
  .extern C1FLTCON4        /* 0xBF880100 */
  .extern C1FLTCON4CLR     /* 0xBF880104 */
  .extern C1FLTCON4SET     /* 0xBF880108 */
  .extern C1FLTCON4INV     /* 0xBF88010C */
  .extern C1FLTCON5        /* 0xBF880110 */
  .extern C1FLTCON5CLR     /* 0xBF880114 */
  .extern C1FLTCON5SET     /* 0xBF880118 */
  .extern C1FLTCON5INV     /* 0xBF88011C */
  .extern C1FLTCON6        /* 0xBF880120 */
  .extern C1FLTCON6CLR     /* 0xBF880124 */
  .extern C1FLTCON6SET     /* 0xBF880128 */
  .extern C1FLTCON6INV     /* 0xBF88012C */
  .extern C1FLTCON7        /* 0xBF880130 */
  .extern C1FLTCON7CLR     /* 0xBF880134 */
  .extern C1FLTCON7SET     /* 0xBF880138 */
  .extern C1FLTCON7INV     /* 0xBF88013C */
  .extern C1RXF0           /* 0xBF880140 */
  .extern C1RXF0CLR        /* 0xBF880144 */
  .extern C1RXF0SET        /* 0xBF880148 */
  .extern C1RXF0INV        /* 0xBF88014C */
  .extern C1RXF1           /* 0xBF880150 */
  .extern C1RXF1CLR        /* 0xBF880154 */
  .extern C1RXF1SET        /* 0xBF880158 */
  .extern C1RXF1INV        /* 0xBF88015C */
  .extern C1RXF2           /* 0xBF880160 */
  .extern C1RXF2CLR        /* 0xBF880164 */
  .extern C1RXF2SET        /* 0xBF880168 */
  .extern C1RXF2INV        /* 0xBF88016C */
  .extern C1RXF3           /* 0xBF880170 */
  .extern C1RXF3CLR        /* 0xBF880174 */
  .extern C1RXF3SET        /* 0xBF880178 */
  .extern C1RXF3INV        /* 0xBF88017C */
  .extern C1RXF4           /* 0xBF880180 */
  .extern C1RXF4CLR        /* 0xBF880184 */
  .extern C1RXF4SET        /* 0xBF880188 */
  .extern C1RXF4INV        /* 0xBF88018C */
  .extern C1RXF5           /* 0xBF880190 */
  .extern C1RXF5CLR        /* 0xBF880194 */
  .extern C1RXF5SET        /* 0xBF880198 */
  .extern C1RXF5INV        /* 0xBF88019C */
  .extern C1RXF6           /* 0xBF8801A0 */
  .extern C1RXF6CLR        /* 0xBF8801A4 */
  .extern C1RXF6SET        /* 0xBF8801A8 */
  .extern C1RXF6INV        /* 0xBF8801AC */
  .extern C1RXF7           /* 0xBF8801B0 */
  .extern C1RXF7CLR        /* 0xBF8801B4 */
  .extern C1RXF7SET        /* 0xBF8801B8 */
  .extern C1RXF7INV        /* 0xBF8801BC */
  .extern C1RXF8           /* 0xBF8801C0 */
  .extern C1RXF8CLR        /* 0xBF8801C4 */
  .extern C1RXF8SET        /* 0xBF8801C8 */
  .extern C1RXF8INV        /* 0xBF8801CC */
  .extern C1RXF9           /* 0xBF8801D0 */
  .extern C1RXF9CLR        /* 0xBF8801D4 */
  .extern C1RXF9SET        /* 0xBF8801D8 */
  .extern C1RXF9INV        /* 0xBF8801DC */
  .extern C1RXF10          /* 0xBF8801E0 */
  .extern C1RXF10CLR       /* 0xBF8801E4 */
  .extern C1RXF10SET       /* 0xBF8801E8 */
  .extern C1RXF10INV       /* 0xBF8801EC */
  .extern C1RXF11          /* 0xBF8801F0 */
  .extern C1RXF11CLR       /* 0xBF8801F4 */
  .extern C1RXF11SET       /* 0xBF8801F8 */
  .extern C1RXF11INV       /* 0xBF8801FC */
  .extern C1RXF12          /* 0xBF880200 */
  .extern C1RXF12CLR       /* 0xBF880204 */
  .extern C1RXF12SET       /* 0xBF880208 */
  .extern C1RXF12INV       /* 0xBF88020C */
  .extern C1RXF13          /* 0xBF880210 */
  .extern C1RXF13CLR       /* 0xBF880214 */
  .extern C1RXF13SET       /* 0xBF880218 */
  .extern C1RXF13INV       /* 0xBF88021C */
  .extern C1RXF14          /* 0xBF880220 */
  .extern C1RXF14CLR       /* 0xBF880224 */
  .extern C1RXF14SET       /* 0xBF880228 */
  .extern C1RXF14INV       /* 0xBF88022C */
  .extern C1RXF15          /* 0xBF880230 */
  .extern C1RXF15CLR       /* 0xBF880234 */
  .extern C1RXF15SET       /* 0xBF880238 */
  .extern C1RXF15INV       /* 0xBF88023C */
  .extern C1RXF16          /* 0xBF880240 */
  .extern C1RXF16CLR       /* 0xBF880244 */
  .extern C1RXF16SET       /* 0xBF880248 */
  .extern C1RXF16INV       /* 0xBF88024C */
  .extern C1RXF17          /* 0xBF880250 */
  .extern C1RXF17CLR       /* 0xBF880254 */
  .extern C1RXF17SET       /* 0xBF880258 */
  .extern C1RXF17INV       /* 0xBF88025C */
  .extern C1RXF18          /* 0xBF880260 */
  .extern C1RXF18CLR       /* 0xBF880264 */
  .extern C1RXF18SET       /* 0xBF880268 */
  .extern C1RXF18INV       /* 0xBF88026C */
  .extern C1RXF19          /* 0xBF880270 */
  .extern C1RXF19CLR       /* 0xBF880274 */
  .extern C1RXF19SET       /* 0xBF880278 */
  .extern C1RXF19INV       /* 0xBF88027C */
  .extern C1RXF20          /* 0xBF880280 */
  .extern C1RXF20CLR       /* 0xBF880284 */
  .extern C1RXF20SET       /* 0xBF880288 */
  .extern C1RXF20INV       /* 0xBF88028C */
  .extern C1RXF21          /* 0xBF880290 */
  .extern C1RXF21CLR       /* 0xBF880294 */
