MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAA169/mcu.h
#define _USBCSR0_EP1TXIF_POSITION                0x00000011
#define _USBCSR0_EP1TXIF_MASK                    0x00020000
#define _USBCSR0_EP1TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP2TXIF_POSITION                0x00000012
#define _USBCSR0_EP2TXIF_MASK                    0x00040000
#define _USBCSR0_EP2TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP3TXIF_POSITION                0x00000013
#define _USBCSR0_EP3TXIF_MASK                    0x00080000
#define _USBCSR0_EP3TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP4TXIF_POSITION                0x00000014
#define _USBCSR0_EP4TXIF_MASK                    0x00100000
#define _USBCSR0_EP4TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP5TXIF_POSITION                0x00000015
#define _USBCSR0_EP5TXIF_MASK                    0x00200000
#define _USBCSR0_EP5TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP6TXIF_POSITION                0x00000016
#define _USBCSR0_EP6TXIF_MASK                    0x00400000
#define _USBCSR0_EP6TXIF_LENGTH                  0x00000001

#define _USBCSR0_EP7TXIF_POSITION                0x00000017
#define _USBCSR0_EP7TXIF_MASK                    0x00800000
#define _USBCSR0_EP7TXIF_LENGTH                  0x00000001

#define _USBCSR1_EP1RXIF_POSITION                0x00000001
#define _USBCSR1_EP1RXIF_MASK                    0x00000002
#define _USBCSR1_EP1RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP2RXIF_POSITION                0x00000002
#define _USBCSR1_EP2RXIF_MASK                    0x00000004
#define _USBCSR1_EP2RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP3RXIF_POSITION                0x00000003
#define _USBCSR1_EP3RXIF_MASK                    0x00000008
#define _USBCSR1_EP3RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP4RXIF_POSITION                0x00000004
#define _USBCSR1_EP4RXIF_MASK                    0x00000010
#define _USBCSR1_EP4RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP5RXIF_POSITION                0x00000005
#define _USBCSR1_EP5RXIF_MASK                    0x00000020
#define _USBCSR1_EP5RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP6RXIF_POSITION                0x00000006
#define _USBCSR1_EP6RXIF_MASK                    0x00000040
#define _USBCSR1_EP6RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP7RXIF_POSITION                0x00000007
#define _USBCSR1_EP7RXIF_MASK                    0x00000080
#define _USBCSR1_EP7RXIF_LENGTH                  0x00000001

#define _USBCSR1_EP0IE_POSITION                  0x00000010
#define _USBCSR1_EP0IE_MASK                      0x00010000
#define _USBCSR1_EP0IE_LENGTH                    0x00000001

#define _USBCSR1_EP1TXIE_POSITION                0x00000011
#define _USBCSR1_EP1TXIE_MASK                    0x00020000
#define _USBCSR1_EP1TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP2TXIE_POSITION                0x00000012
#define _USBCSR1_EP2TXIE_MASK                    0x00040000
#define _USBCSR1_EP2TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP3TXIE_POSITION                0x00000013
#define _USBCSR1_EP3TXIE_MASK                    0x00080000
#define _USBCSR1_EP3TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP4TXIE_POSITION                0x00000014
#define _USBCSR1_EP4TXIE_MASK                    0x00100000
#define _USBCSR1_EP4TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP5TXIE_POSITION                0x00000015
#define _USBCSR1_EP5TXIE_MASK                    0x00200000
#define _USBCSR1_EP5TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP6TXIE_POSITION                0x00000016
#define _USBCSR1_EP6TXIE_MASK                    0x00400000
#define _USBCSR1_EP6TXIE_LENGTH                  0x00000001

#define _USBCSR1_EP7TXIE_POSITION                0x00000017
#define _USBCSR1_EP7TXIE_MASK                    0x00800000
#define _USBCSR1_EP7TXIE_LENGTH                  0x00000001

#define _USBCSR2_EP1RXIE_POSITION                0x00000001
#define _USBCSR2_EP1RXIE_MASK                    0x00000002
#define _USBCSR2_EP1RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP2RXIE_POSITION                0x00000002
#define _USBCSR2_EP2RXIE_MASK                    0x00000004
#define _USBCSR2_EP2RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP3RXIE_POSITION                0x00000003
#define _USBCSR2_EP3RXIE_MASK                    0x00000008
#define _USBCSR2_EP3RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP4RXIE_POSITION                0x00000004
#define _USBCSR2_EP4RXIE_MASK                    0x00000010
#define _USBCSR2_EP4RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP5RXIE_POSITION                0x00000005
#define _USBCSR2_EP5RXIE_MASK                    0x00000020
#define _USBCSR2_EP5RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP6RXIE_POSITION                0x00000006
#define _USBCSR2_EP6RXIE_MASK                    0x00000040
#define _USBCSR2_EP6RXIE_LENGTH                  0x00000001

#define _USBCSR2_EP7RXIE_POSITION                0x00000007
#define _USBCSR2_EP7RXIE_MASK                    0x00000080
#define _USBCSR2_EP7RXIE_LENGTH                  0x00000001

#define _USBCSR2_SUSPIF_POSITION                 0x00000010
#define _USBCSR2_SUSPIF_MASK                     0x00010000
#define _USBCSR2_SUSPIF_LENGTH                   0x00000001

#define _USBCSR2_RESUMEIF_POSITION               0x00000011
#define _USBCSR2_RESUMEIF_MASK                   0x00020000
#define _USBCSR2_RESUMEIF_LENGTH                 0x00000001

#define _USBCSR2_RESETIF_POSITION                0x00000012
#define _USBCSR2_RESETIF_MASK                    0x00040000
#define _USBCSR2_RESETIF_LENGTH                  0x00000001

#define _USBCSR2_SOFIF_POSITION                  0x00000013
#define _USBCSR2_SOFIF_MASK                      0x00080000
#define _USBCSR2_SOFIF_LENGTH                    0x00000001

#define _USBCSR2_CONNIF_POSITION                 0x00000014
#define _USBCSR2_CONNIF_MASK                     0x00100000
#define _USBCSR2_CONNIF_LENGTH                   0x00000001

