MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAA169/mcu.h
/*  The following device macros are predefined by the MPLAB XC32
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MZ2064DAA169
#  define __32MZ2064DAA169 1
#endif
#ifndef __32MZ2064DAA169__
#  define __32MZ2064DAA169__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32MZ
#  define __PIC32MZ 1
#endif
#ifndef __PIC32MZ__
#  define __PIC32MZ__ 1
#endif
#undef __PIC32_FLASH_SIZE
#define __PIC32_FLASH_SIZE 2048
#ifndef __PIC32_FEATURE_SET
#  define __PIC32_FEATURE_SET "DA"
#endif
#ifndef __PIC32_FEATURE_SET__
#  define __PIC32_FEATURE_SET__ "DA"
#endif
#ifndef __PIC32_FEATURE_SET0
#  define __PIC32_FEATURE_SET0 'D'
#endif
#ifndef __PIC32_FEATURE_SET1
#  define __PIC32_FEATURE_SET1 'A'
#endif
#ifndef __PIC32_PRODUCT_GROUP
#  define __PIC32_PRODUCT_GROUP 'A'
#endif
#ifndef __PIC32_PIN_COUNT
#  define __PIC32_PIN_COUNT 169
#endif

/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_L1CACHE
# define __PIC32_HAS_L1CACHE 1
#endif
#ifndef __PIC32_HAS_MIPS32R2
# define __PIC32_HAS_MIPS32R2 1
#endif
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_DSPR2
# define __PIC32_HAS_DSPR2 1
#endif
#ifndef __PIC32_HAS_SSX
# define __PIC32_HAS_SSX 1
#endif
#ifndef __PIC32_HAS_MMU_MZ_FIXED
# define __PIC32_HAS_MMU_MZ_FIXED 1
#endif
#ifndef __PIC32_HAS_INIT_DATA
# define __PIC32_HAS_INIT_DATA 1
#endif
#ifndef __PIC32_SRS_SET_COUNT
# define __PIC32_SRS_SET_COUNT 8
#endif

#endif
